[
  {
    "id": "feature-1765387670653-bl83444lj",
    "category": "Kanban",
    "description": "In the output logs of the proc agent output in the file diffs Can you add a scroll bar so it actually scroll to see all these new styles right now it seems like I can't scroll",
    "steps": [],
    "status": "verified",
    "startedAt": "2025-12-10T17:42:09.158Z",
    "imagePaths": [],
    "skipTests": true,
    "summary": "Fixed scrolling for file diffs in agent output modal. Changed approach: parent container (agent-output-modal.tsx) now handles scrolling with overflow-y-auto, while GitDiffPanel uses natural height without flex-based scrolling. Modified: agent-output-modal.tsx (line 304), git-diff-panel.tsx (lines 461, 500, 525, 614).",
    "model": "opus",
    "thinkingLevel": "none"
  },
  {
    "id": "feature-1765387746902-na752mp1y",
    "category": "Kanban",
    "description": "When the add feature modal pops up, make sure that the description is always the main focus. When it first loads up. Do not focus the prompt tab, which is currently doing this.",
    "steps": [],
    "status": "verified",
    "startedAt": "2025-12-10T17:29:13.854Z",
    "imagePaths": [],
    "skipTests": true,
    "summary": "Added autoFocus prop to DescriptionImageDropZone component. Modified: description-image-dropzone.tsx (added autoFocus prop support), board-view.tsx (enabled autoFocus on add feature modal). Now the description textarea receives focus when the modal opens instead of the prompt tab.",
    "model": "opus",
    "thinkingLevel": "none"
  },
  {
    "id": "feature-1765388139100-ln31jgp5n",
    "category": "Uncategorized",
    "description": "Can you add a disclaimer .md file to this project saying that this uses a bunch of AI related tooling which could have access to your operating system and change and delete files and so use at your own risk. We tried to check it for security of vulnerability to make sure it's good. But you assume the risk and you should be reviewing the code yourself before you try to run it. And also sandboxing this so it doesn't have access to your whole operating system like using Docker to sandbox before you run it or use a virtual machine to sandbox it. and that we do not recommend running locally on your computer due to the risk of it having access to everything on your computer.\n\nUpdate or read me with a short paragraph overview/description at the top followed by a disclaimer section in red that points to the disclaimer file with the same disclaimer information.\n\nThen a section that lists out all the features of cool emojis.",
    "steps": [],
    "status": "verified",
    "startedAt": "2025-12-10T17:35:40.700Z",
    "imagePaths": [],
    "skipTests": true,
    "summary": "Created DISCLAIMER.md with comprehensive security warnings about AI tooling risks and sandboxing recommendations. Updated README.md with project overview, red caution disclaimer section linking to DISCLAIMER.md, and features list with emojis covering all major functionality (Kanban, AI agents, multi-model support, etc.).",
    "model": "opus",
    "thinkingLevel": "none"
  },
  {
    "id": "feature-1765388388144-oa1dewze9",
    "category": "Uncategorized",
    "description": "Please fix the styling of the hotkeys to be more using the theme colors. Notice that they're kind of gray. I would rather than have some type of like light green if they're not active and then the brighter green if they are active and also the add feature but in the top right it's not very legible. So fix the accessibility of the hotkey but also keep it within the theme. You might just have to change the text inside of it to be bright green.",
    "steps": [],
    "status": "verified",
    "startedAt": "2025-12-10T17:40:02.745Z",
    "imagePaths": [
      {
        "id": "img-1765388352835-dgx4ishp0",
        "path": "/Users/webdevcody/Library/Application Support/automaker/images/1765388352832-6jnbgw8kg_Screenshot_2025-12-10_at_12.39.10_PM.png",
        "filename": "Screenshot 2025-12-10 at 12.39.10 PM.png",
        "mimeType": "image/png"
      },
      {
        "id": "img-1765388356955-a0gdovp5b",
        "path": "/Users/webdevcody/Library/Application Support/automaker/images/1765388356954-d59a65nf9_Screenshot_2025-12-10_at_12.39.15_PM.png",
        "filename": "Screenshot 2025-12-10 at 12.39.15 PM.png",
        "mimeType": "image/png"
      }
    ],
    "skipTests": true,
    "model": "opus",
    "thinkingLevel": "none"
  },
  {
    "id": "feature-1765388402095-x66aduwg3",
    "category": "Uncategorized",
    "description": "Can you please add some spacing and fix the styling of the hotkey with the command enter and make it so they're both vertically aligned for those icons?",
    "steps": [],
    "status": "waiting_approval",
    "startedAt": "2025-12-10T17:44:08.667Z",
    "imagePaths": [
      {
        "id": "img-1765388390408-eefybe95t",
        "path": "/Users/webdevcody/Library/Application Support/automaker/images/1765388390408-nn320yoyc_Screenshot_2025-12-10_at_12.39.47_PM.png",
        "filename": "Screenshot 2025-12-10 at 12.39.47 PM.png",
        "mimeType": "image/png"
      }
    ],
    "skipTests": true,
    "model": "opus",
    "thinkingLevel": "none"
  },
  {
    "id": "feature-1765388662444-as3hqn7be",
    "category": "Uncategorized",
    "description": "Fix the styling on all the buttons when I hover over them with my mouse they never change to a click mouse cursor. In order they seem to show any type of like hover state changes, if they do, at least for the certain game I'm using, it's not very obvious that you're hovering over the button.",
    "steps": [],
    "status": "waiting_approval",
    "startedAt": "2025-12-10T17:45:59.666Z",
    "imagePaths": [],
    "skipTests": true,
    "summary": "Fixed hover cursor styling on all interactive elements. Modified: button.tsx (added cursor-pointer to base styles), dropdown-menu.tsx (added cursor-pointer to all menu items), checkbox.tsx (added cursor-pointer), tabs.tsx (added cursor-pointer to triggers), dialog.tsx (added cursor-pointer to close button), slider.tsx (added cursor-grab to thumb, cursor-pointer to track), globals.css (added global CSS rules for clickable elements to ensure consistent cursor behavior).",
    "model": "opus",
    "thinkingLevel": "none"
  },
  {
    "id": "feature-1765388693856-yx1dk1acj",
    "category": "Kanban",
    "description": "The tabs in the add new feature modal for the prompt model and testing tabs. They don't seem to look like tabs when I'm on a certain theme. Can you verify that those are hooked into the theme? And make sure that the active one is colored differently than the unactive ones. Keep the primary colors when doing this.",
    "steps": [],
    "status": "waiting_approval",
    "startedAt": "2025-12-10T17:46:00.019Z",
    "imagePaths": [],
    "skipTests": true,
    "summary": "Fixed tabs component theme integration. Modified: tabs.tsx. Changes: (1) Added visible border to TabsList container using theme's border color, (2) Changed inactive tab text to foreground/70 for better contrast, (3) Enhanced active tab with shadow-md and semi-transparent primary border, (4) Improved hover state with full accent background. Active tabs now properly use bg-primary/text-primary-foreground which adapts to each theme.",
    "model": "opus",
    "thinkingLevel": "none"
  },
  {
    "id": "feature-1765388754462-bek0flvkj",
    "category": "Uncategorized",
    "description": "There's a strange issue when I when when these agents are like doing things it seems like it completely refreshes the whole Kanban board and there's like a black flash. Can you verify that the data loading does not cause the entire component to refresh? Maybe there's an issue with the react effect or how the component is rendered maybe we need some used memos or something but it shouldn't refresh the whole page it should just like update the individual cards when they change.",
    "steps": [],
    "status": "waiting_approval",
    "startedAt": "2025-12-10T17:47:20.170Z",
    "imagePaths": [],
    "skipTests": true,
    "summary": "Fixed Kanban board flash/refresh issue. Changes: (1) board-view.tsx - Added isInitialLoadRef to only show loading spinner on initial load, not on feature reloads; memoized column features with useMemo to prevent recalculation on every render. (2) kanban-card.tsx - Wrapped with React.memo to prevent unnecessary re-renders. (3) kanban-column.tsx - Wrapped with React.memo for performance. The flash was caused by loadFeatures setting isLoading=true on every reload, which caused the entire board to unmount and show a loading spinner.",
    "model": "opus",
    "thinkingLevel": "none"
  },
  {
    "id": "feature-1765388793845-yhluf0sry",
    "category": "Uncategorized",
    "description": "Add in the ability so that every project can have its own selected theme. This will allow me to have different projects have different themes so I can easily differentiate when I have one project selected or not.",
    "steps": [],
    "status": "waiting_approval",
    "startedAt": "2025-12-10T18:00:33.814Z",
    "imagePaths": [],
    "skipTests": true,
    "summary": "Fixed per-project theme support. Modified: settings-view.tsx (now saves theme to project when project is selected, shows label indicating scope), page.tsx (computes effectiveTheme from currentProject?.theme || theme), app-store.ts (added setProjectTheme action, theme property on Project interface). When a project is selected, changing theme in Settings saves to that project only.",
    "model": "opus",
    "thinkingLevel": "none"
  },
  {
    "id": "feature-1765389333728-y74hmz2yp",
    "category": "Agent Runner",
    "description": "On the Agent Runner, I took a screenshot and dropped it into the text area and after a certain amount of time, it's like the image preview just completely went away. Can you debug and fix this on the Agent Runner?",
    "steps": [],
    "status": "backlog",
    "imagePaths": [],
    "skipTests": true,
    "model": "opus",
    "thinkingLevel": "none"
  },
  {
    "id": "feature-1765389352488-j9bez5ztx",
    "category": "Kanban",
    "description": "It seems like the category typehead is no longer working. Can you double check that code didn't break? It should have kept track of categories inside of the categories.json file inside the .automaker folder when adding new features modal",
    "steps": [],
    "status": "backlog",
    "imagePaths": [],
    "skipTests": true,
    "model": "opus",
    "thinkingLevel": "none"
  },
  {
    "id": "feature-1765389420151-jzdsjzn9u",
    "category": "Kanban",
    "description": "Add in the ability to just click and drag a card from the waiting approval directly into the verify column as I can usually just commit it manually if I want to.",
    "steps": [],
    "status": "waiting_approval",
    "startedAt": "2025-12-10T18:05:08.252Z",
    "imagePaths": [],
    "skipTests": true,
    "summary": "Fixed drag-and-drop from waiting_approval to verified column. The issue was condition ordering in handleDragEnd - the skipTests check was intercepting waiting_approval features before they could be handled. Moved waiting_approval status check before skipTests check in board-view.tsx:731-752. Also updated agent memory with this lesson.",
    "model": "opus",
    "thinkingLevel": "none"
  },
  {
    "id": "feature-1765389468077-9x3vt1yjq",
    "category": "Uncategorized",
    "description": "The commit functionality on the waiting approval cards doesn't seem to work. It just committed everything in my working copy for git. I think I should be a little bit more intelligent and figure out what files it changed for that AI session and then only try to git add those individual files and commit those. Right now it just basically did a git add all and committed those. Re-factor the prompting or figure out a way to make it so it's more specific on what it's going to commit with the future change.",
    "steps": [],
    "status": "backlog",
    "imagePaths": [],
    "skipTests": true,
    "model": "opus",
    "thinkingLevel": "none"
  },
  {
    "id": "feature-1765389502705-6deep7mvi",
    "category": "Uncategorized",
    "description": "I'm noticing that a lot of buttons in the UI, especially the ones that are submitting, are either missing the submit hotkey or they're not styled properly. Look at the add feature submit button that's on the add feature modal and abstract away a submit button so that on every single page that needs to submit something I can reuse this type of hotkey functionality. In fact, every single button should be abstracted enough where I can provide a hotkey and it will automatically listen if I press that hotkey when it's in view.",
    "steps": [],
    "status": "backlog",
    "imagePaths": [],
    "skipTests": true,
    "model": "opus",
    "thinkingLevel": "none"
  },
  {
    "id": "feature-1765389772166-an3yk3kpo",
    "category": "Uncategorized",
    "description": "Can you add some more padding to the bottom of the settings panel? Notice that I can't scroll down all the way. And that doesn't highlight the left sub navigation to highlight it pink when I'm on that section. I should be able to scroll a bit further and just have like blank space at the bottom. So I can eventually get to that actual section.",
    "steps": [],
    "status": "backlog",
    "imagePaths": [
      {
        "id": "img-1765389750685-jhq6rcidc",
        "path": "/Users/webdevcody/Library/Application Support/automaker/images/1765389750683-mqb0j7a3z_Screenshot_2025-12-10_at_1.02.26_PM.png",
        "filename": "Screenshot 2025-12-10 at 1.02.26 PM.png",
        "mimeType": "image/png"
      }
    ],
    "skipTests": true,
    "model": "opus",
    "thinkingLevel": "none"
  },
  {
    "id": "feature-1765389829239-bbk596u6z",
    "category": "Uncategorized",
    "description": "Add some type of XML highlighting to the spec editor view. Right now it's just all grayscale and it's kind of ugly to look at. And try to make the syntax highlighting match the current selected theme.",
    "steps": [],
    "status": "backlog",
    "imagePaths": [],
    "skipTests": true,
    "model": "opus",
    "thinkingLevel": "none"
  },
  {
    "id": "feature-1765389859334-si9ivtehw",
    "category": "Uncategorized",
    "description": "Add a search bar to the top of the Kanban column that allows me to search the filter down just to show the cards I'm interested in by keyword.",
    "steps": [],
    "status": "in_progress",
    "startedAt": "2025-12-10T18:09:26.193Z",
    "imagePaths": [],
    "skipTests": true,
    "summary": "Added search bar to Kanban board. Modified: board-view.tsx. Features: 1) Search input with icon at top of columns, 2) Case-insensitive filtering by description or category, 3) Clear button to reset search, 4) Real-time filtering as you type.",
    "model": "opus",
    "thinkingLevel": "none"
  },
  {
    "id": "feature-1765390022638-nalulsdxv",
    "category": "Uncategorized",
    "description": "In the project select can you actually remove the whole like 1 2 3 4 5 hotkeys instead? Just make it be a type ahead so when I open the panel I just should be able to type in the first letter or two of the project that I want and press enter and that should Just select it for me",
    "steps": [],
    "status": "backlog",
    "imagePaths": [],
    "skipTests": true,
    "model": "opus",
    "thinkingLevel": "none"
  },
  {
    "id": "feature-1765390055621-ewc4w7k5h",
    "category": "Uncategorized",
    "description": "In the add new feature prompt, instead of disabling the add feature button until we type into the description, keep it enabled. But if you click it, make sure you just show the client side validation and turn the description box in any other required field as red so that the user knows they have to fill it in.",
    "steps": [],
    "status": "backlog",
    "imagePaths": [],
    "skipTests": true,
    "model": "opus",
    "thinkingLevel": "none"
  },
  {
    "id": "feature-1765390131625-ymqxr5gln",
    "category": "Uncategorized",
    "description": "Can you please in the top right of the Kanban board use the show three icons for the Kanban card display formatting. You can look at the settings page to see that there's three different settings that we use for displaying the Kanban card information. But I also just want this to be really quickly accessible at the top right of the Kanban that they can switch between those three toggles. Keep them simple only just icons you don't need to put words in them. Make sure they do have harbor states though, or tooltips I mean.",
    "steps": [],
    "status": "backlog",
    "imagePaths": [],
    "skipTests": true,
    "model": "opus",
    "thinkingLevel": "none"
  }
]